Revit 2027 API
SKPImportOptions(SKPImportOptions) Constructor
 Constructs a new instance of SKPImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SKPImportOptions(
	SKPImportOptions option
)
Public Sub New (
	option As SKPImportOptions
)
public:
SKPImportOptions(
	SKPImportOptions^ option
)
new :
        option : SKPImportOptions -> SKPImportOptions
Parameters
option SKPImportOptions
 The SKP options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SKPImportOptions Class
SKPImportOptions Overload
Autodesk.Revit.DB Namespace